{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "name": "conv2d_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "name": "conv2d_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_regularizer": null, "trainable": true}}]}